#Создать объект менеджера контекста который будет переходить
#  в папку которую он принимает на вход.
# Так же ваш объект должен принимать исключение которое он будет подавлять.
# Если флаг об исключении отсутствует, исключение должно быть поднято.
#


#Нужно написать класс, который будет собирать информацию о погоде в регионе.
# API вы найдете на https://darksky.net/.
# Вам нужно сделать запрос на один из API представленныx в документации.
#  Ваша задача подумать над тем как будет устроен ваш класс,
# какие методы он будет включать, где и как вы будете
# конфигурировать API, хранить ключ, обрабатывать респонс

import request

class WeatherClass(object):
    pass